; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p1-0 - location
	p1-2 - location
	p2-3 - location
	p2-4 - location
	p3-0 - location
	p3-1 - location
	p4-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s2)
	(at driver4 s2)
	(at driver5 s1)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s2)
	(at package2 s3)
	(at package3 s2)
	(at package4 s0)
	(at package5 s3)
	(at package6 s2)
	(at package7 s1)
	(at package8 s1)
	(at package9 s1)
	(at package10 s4)
	(at package11 s2)
	(at package12 s4)
	(at package13 s2)
	(at package14 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 48)
	(= (time-to-drive s2 s0) 48)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 32)
	(= (time-to-drive s3 s0) 32)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 39)
	(= (time-to-drive s4 s0) 39)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 36)
	(= (time-to-drive s0 s1) 36)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 59)
	(= (time-to-drive s2 s1) 59)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 92)
	(= (time-to-drive s3 s2) 92)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 76)
	(= (time-to-drive s4 s2) 76)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 92)
	(= (time-to-drive s1 s3) 92)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 76)
	(= (time-to-drive s1 s4) 76)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s1)
	(at driver5 s3)
	(at truck1 s1)
	(at truck2 s2)
	(at truck4 s3)
	(at truck5 s0)
	(at package1 s0)
	(at package2 s0)
	(at package3 s3)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s0)
	(at package8 s1)
	(at package9 s0)
	(at package10 s4)
	(at package11 s2)
	(at package12 s0)
	(at package13 s2)
	(at package14 s3)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver2 truck1 s4)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 22
2. (walk driver5 s1 p3-1)
   deleted: (at driver5 s1)
   added: (at driver5 p3-1)
   goals met: 6 of 22
3. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 760
   goals met: 6 of 22
4. (walk driver4 s2 p1-2)
   deleted: (at driver4 s2)
   added: (at driver4 p1-2)
   goals met: 6 of 22
5. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 7 of 22
6. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 22
7. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 22
8. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 7 of 22
9. (load-truck package6 truck1 s2)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 7 of 22
10. (load-truck package14 truck1 s2)
   deleted: (at package14 s2)
   added: (in package14 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 7 of 22
11. (walk driver5 p3-1 s3)
   deleted: (at driver5 p3-1)
   added: (at driver5 s3)
   goals met: 8 of 22
12. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 760 to 1940
   goals met: 9 of 22
13. (walk driver4 p1-2 s1)
   deleted: (at driver4 p1-2)
   added: (at driver4 s1)
   goals met: 10 of 22
14. (unload-truck package6 truck1 s1)
   deleted: (in package6 truck1)
   added: (at package6 s1)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 11 of 22
15. (load-truck package7 truck1 s1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 11 of 22
16. (load-truck package9 truck1 s1)
   deleted: (at package9 s1)
   added: (in package9 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 11 of 22
17. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 1940 to 2840
   goals met: 10 of 22
18. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 11 of 22
19. (unload-truck package7 truck1 s0)
   deleted: (in package7 truck1)
   added: (at package7 s0)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 12 of 22
20. (unload-truck package9 truck1 s0)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 13 of 22
21. (drive-truck truck1 s0 s4 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 2840 to 3347
   goals met: 13 of 22
22. (load-truck package12 truck1 s4)
   deleted: (at package12 s4)
   added: (in package12 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 13 of 22
23. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 3347 to 3971
   goals met: 13 of 22
24. (unload-truck package12 truck1 s0)
   deleted: (in package12 truck1)
   added: (at package12 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 14 of 22
25. (board-truck driver5 truck2 s3)
   deleted: (at driver5 s3) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 13 of 22
26. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 13 of 22
27. (load-truck package5 truck2 s3)
   deleted: (at package5 s3)
   added: (in package5 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 13 of 22
28. (drive-truck truck1 s0 s3 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 3971 to 4387
   goals met: 13 of 22
29. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 14 of 22
30. (unload-truck package14 truck1 s3)
   deleted: (in package14 truck1)
   added: (at package14 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 15 of 22
31. (drive-truck truck1 s3 s0 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 4387 to 4707
   goals met: 15 of 22
32. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 16 of 22
33. (drive-truck truck2 s3 s0 driver5)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 4707 to 5123
   goals met: 16 of 22
34. (unload-truck package2 truck2 s0)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 17 of 22
35. (drive-truck truck2 s0 s3 driver5)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 5123 to 5475
   goals met: 17 of 22
36. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 16 of 22
37. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 5475 to 5835
   goals met: 17 of 22
38. (drive-truck truck2 s3 s2 driver5)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 5835 to 6847
   goals met: 18 of 22
39. (unload-truck package5 truck2 s2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 19 of 22
40. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 6847 to 7207
   goals met: 18 of 22
41. (drive-truck truck1 s0 s3 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 7207 to 7527
   goals met: 18 of 22
42. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 18 of 22
43. (drive-truck truck2 s2 s3 driver5)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 7527 to 8447
   goals met: 17 of 22
44. (walk driver3 s3 p3-0)
   deleted: (at driver3 s3)
   added: (at driver3 p3-0)
   goals met: 17 of 22
45. (walk driver3 p3-0 s0)
   deleted: (at driver3 p3-0)
   added: (at driver3 s0)
   goals met: 18 of 22
46. (disembark-truck driver5 truck2 s3)
   deleted: (driving driver5 truck2)
   added: (at driver5 s3) (empty truck2)
   goals met: 19 of 22
47. (board-truck driver5 truck1 s3)
   deleted: (at driver5 s3) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 18 of 22
48. (drive-truck truck1 s3 s1 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 8447 to 9367
   goals met: 19 of 22
49. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   goals met: 18 of 22
50. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   goals met: 18 of 22
51. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 18 of 22
52. (drive-truck truck1 s1 s3 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 9367 to 10287
   goals met: 17 of 22
53. (drive-truck truck5 s3 s2 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (fuel-used) from 10287 to 11207
   goals met: 17 of 22
54. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 18 of 22
55. (disembark-truck driver5 truck1 s3)
   deleted: (driving driver5 truck1)
   added: (at driver5 s3) (empty truck1)
   goals met: 19 of 22
56. (board-truck driver5 truck2 s3)
   deleted: (at driver5 s3) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 18 of 22
57. (drive-truck truck2 s3 s2 driver5)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 11207 to 12127
   goals met: 19 of 22
58. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   goals met: 18 of 22
59. (disembark-truck driver5 truck2 s2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s2) (empty truck2)
   goals met: 18 of 22
60. (walk driver5 s2 p2-3)
   deleted: (at driver5 s2)
   added: (at driver5 p2-3)
   goals met: 18 of 22
61. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   goals met: 18 of 22
62. (walk driver5 p2-3 s3)
   deleted: (at driver5 p2-3)
   added: (at driver5 s3)
   goals met: 19 of 22
63. (board-truck driver5 truck1 s3)
   deleted: (at driver5 s3) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 18 of 22
64. (drive-truck truck1 s3 s2 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 12127 to 13047
   goals met: 18 of 22
65. (disembark-truck driver5 truck1 s2)
   deleted: (driving driver5 truck1)
   added: (at driver5 s2) (empty truck1)
   goals met: 18 of 22
66. (walk driver5 s2 p2-3)
   deleted: (at driver5 s2)
   added: (at driver5 p2-3)
   goals met: 18 of 22
67. (walk driver5 p2-3 s3)
   deleted: (at driver5 p2-3)
   added: (at driver5 s3)
   goals met: 19 of 22
68. (walk driver4 s1 p1-2)
   deleted: (at driver4 s1)
   added: (at driver4 p1-2)
   goals met: 18 of 22
69. (walk driver4 p1-2 s2)
   deleted: (at driver4 p1-2)
   added: (at driver4 s2)
   goals met: 18 of 22
70. (board-truck driver4 truck1 s2)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 18 of 22
71. (drive-truck truck1 s2 s1 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 13047 to 13637
   goals met: 19 of 22
72. (walk driver1 s4 p2-4)
   deleted: (at driver1 s4)
   added: (at driver1 p2-4)
   goals met: 19 of 22
73. (disembark-truck driver4 truck1 s1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 20 of 22
74. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 20 of 22
75. (walk driver1 p2-4 s2)
   deleted: (at driver1 p2-4)
   added: (at driver1 s2)
   goals met: 20 of 22
76. (board-truck driver1 truck5 s2)
   deleted: (at driver1 s2) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 20 of 22
77. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 21 of 22
78. (drive-truck truck5 s2 s0 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 13637 to 14117
   goals met: 22 of 22
